spec/support/vcr_cassettes/mpi/find_candidate/failure_multiple_matches.yml

---
http_interactions:
- request:
    method: post
    uri: "<MVI_URL>"
    body:
      encoding: ASCII-8BIT
      base64_string: |
        CjxlbnY6RW52ZWxvcGUgeG1sbnM6c29hcGVuYz0iaHR0cDovL3NjaGVtYXMu
        eG1sc29hcC5vcmcvc29hcC9lbmNvZGluZy8iIHhtbG5zOnhzZD0iaHR0cDov
        L3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEiIHhtbG5zOmVudj0iaHR0cDov
        L3NjaGVtYXMueG1sc29hcC5vcmcvc29hcC9lbnZlbG9wZS8iIHhtbG5zOnhz
        aT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEtaW5zdGFuY2Ui
        PgogIDxlbnY6SGVhZGVyLz4KICA8ZW52OkJvZHk+CiAgICA8aWRtOlBSUEFf
        SU4yMDEzMDVVVjAyIHhtbG5zOmlkbT0iaHR0cDovL3Zhd3cub2VkLm9pdC52
        YS5nb3YiIHhtbG5zOnhzaT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxT
        Y2hlbWHigJBpbnN0YW5jZSIgeHNpOnNjaGVtYUxvY2F0aW9uPSJ1cm46aGw3
        4oCQb3JnOnYzIC4uLy4uL3NjaGVtYS9ITDdWMy9ORTIwMDgvbXVsdGljYWNo
        ZXNjaGVtYXMvUFJQQV9JTjIwMTMwNVVWMDIueHNkIiB4bWxucz0idXJuOmhs
        N+KAkG9yZzp2MyIgSVRTVmVyc2lvbj0iWE1MXzEuMCI+CiAgICAgIDxpZCBy
        b290PSIxLjIuODQwLjExNDM1MC4xLjEzLjAuMS43LjEuMSIgZXh0ZW5zaW9u
        PSIyMDBWR09WLTAzYjI4MDFhLTMwMDUtNGRjYy05YTNjLTdlM2U0YzBkNTI5
        MyIvPgogICAgICA8Y3JlYXRpb25UaW1lIHZhbHVlPSIyMDE5MDgyOTE0Mjkz
        MiIvPgogICAgICA8dmVyc2lvbkNvZGUgY29kZT0iNC4xIi8+CiAgICAgIDxp
        bnRlcmFjdGlvbklkIHJvb3Q9IjIuMTYuODQwLjEuMTEzODgzLjEuNiIgZXh0
        ZW5zaW9uPSJQUlBBX0lOMjAxMzA1VVYwMiIvPgogICAgICA8cHJvY2Vzc2lu
        Z0NvZGUgY29kZT0iVCIvPgogICAgICA8cHJvY2Vzc2luZ01vZGVDb2RlIGNv
        ZGU9IlQiLz4KICAgICAgPGFjY2VwdEFja0NvZGUgY29kZT0iQUwiLz4KICAg
        ICAgPHJlY2VpdmVyIHR5cGVDb2RlPSJSQ1YiPgogICAgICAgIDxkZXZpY2Ug
        Y2xhc3NDb2RlPSJERVYiIGRldGVybWluZXJDb2RlPSJJTlNUQU5DRSI+CiAg
        ICAgICAgICA8aWQgcm9vdD0iMS4yLjg0MC4xMTQzNTAuMS4xMy45OTkuMjM0
        IiBleHRlbnNpb249IjIwME0iLz4KICAgICAgICA8L2RldmljZT4KICAgICAg
        PC9yZWNlaXZlcj4KICAgICAgPHNlbmRlciB0eXBlQ29kZT0iU05EIj4KICAg
        ICAgICA8ZGV2aWNlIGNsYXNzQ29kZT0iREVWIiBkZXRlcm1pbmVyQ29kZT0i
        SU5TVEFOQ0UiPgogICAgICAgICAgPGlkIHJvb3Q9IjIuMTYuODQwLjEuMTEz
        ODgzLjQuMzQ5IiBleHRlbnNpb249IjIwMFZHT1YiLz4KICAgICAgICA8L2Rl
        dmljZT4KICAgICAgPC9zZW5kZXI+CiAgICAgIDxjb250cm9sQWN0UHJvY2Vz
        cyBjbGFzc0NvZGU9IkNBQ1QiIG1vb2RDb2RlPSJFVk4iPgogICAgICAgIDxj
        b2RlIGNvZGU9IlBSUEFfVEUyMDEzMDVVVjAyIiBjb2RlU3lzdGVtPSIyLjE2
        Ljg0MC4xLjExMzg4My4xLjYiLz4KICAgICAgICA8ZGF0YUVudGVyZXIgdHlw
        ZUNvZGU9IkVOVCIgY29udGV4dENvbnRyb2xDb2RlPSJBUCI+CiAgICAgICAg
        ICA8YXNzaWduZWRQZXJzb24gY2xhc3NDb2RlPSJBU1NJR05FRCI+CiAgICAg
        ICAgICAgIDxpZCBleHRlbnNpb249Ijc5NjI5NTk4MCIgcm9vdD0iMi4xNi44
        NDAuMS4xMTM4ODMuNzc3Ljk5OSIvPgogICAgICAgICAgICA8YXNzaWduZWRQ
        ZXJzb24gY2xhc3NDb2RlPSJQU04iIGRldGVybWluZXJDb2RlPSJJTlNUQU5D
        RSI+CiAgICAgICAgICAgICAgPG5hbWU+CiAgICAgICAgICAgICAgICA8Z2l2
        ZW4+S0VOTkVUSDwvZ2l2ZW4+CiAgICAgICAgICAgICAgICA8ZmFtaWx5PkFO
        RFJFV1M8L2ZhbWlseT4KICAgICAgICAgICAgICA8L25hbWU+CiAgICAgICAg
        ICAgIDwvYXNzaWduZWRQZXJzb24+CiAgICAgICAgICA8L2Fzc2lnbmVkUGVy
        c29uPgogICAgICAgIDwvZGF0YUVudGVyZXI+CiAgICAgICAgPHF1ZXJ5QnlQ
        YXJhbWV0ZXI+CiAgICAgICAgICA8cXVlcnlJZCByb290PSIxLjIuODQwLjEx
        NDM1MC4xLjEzLjI4LjEuMTguNS45OTkiIGV4dGVuc2lvbj0iMTgyMDQiLz4K
        ICAgICAgICAgIDxzdGF0dXNDb2RlIGNvZGU9Im5ldyIvPgogICAgICAgICAg
        PG1vZGlmeUNvZGUgY29kZT0iTVZJLkNPTVAyIi8+CiAgICAgICAgICA8aW5p
        dGlhbFF1YW50aXR5IHZhbHVlPSIxIi8+CiAgICAgICAgICA8cGFyYW1ldGVy
        TGlzdD4KICAgICAgICAgICAgPGxpdmluZ1N1YmplY3RBZG1pbmlzdHJhdGl2
        ZUdlbmRlcj4KICAgICAgICAgICAgICA8dmFsdWUgY29kZT0iTSIvPgogICAg
        ICAgICAgICAgIDxzZW1hbnRpY3NUZXh0PkdlbmRlcjwvc2VtYW50aWNzVGV4
        dD4KICAgICAgICAgICAgPC9saXZpbmdTdWJqZWN0QWRtaW5pc3RyYXRpdmVH
        ZW5kZXI+CiAgICAgICAgICAgIDxsaXZpbmdTdWJqZWN0QmlydGhUaW1lPgog
        ICAgICAgICAgICAgIDx2YWx1ZSB2YWx1ZT0iMTk5MDAyMjAiLz4KICAgICAg
        ICAgICAgICA8c2VtYW50aWNzVGV4dD5EYXRlIG9mIEJpcnRoPC9zZW1hbnRp
        Y3NUZXh0PgogICAgICAgICAgICA8L2xpdmluZ1N1YmplY3RCaXJ0aFRpbWU+
        CiAgICAgICAgICAgIDxsaXZpbmdTdWJqZWN0SWQ+CiAgICAgICAgICAgICAg
        PHZhbHVlIHJvb3Q9IjIuMTYuODQwLjEuMTEzODgzLjQuMSIgZXh0ZW5zaW9u
        PSI3OTYyOTU5ODAiLz4KICAgICAgICAgICAgICA8c2VtYW50aWNzVGV4dD5T
        U048L3NlbWFudGljc1RleHQ+CiAgICAgICAgICAgIDwvbGl2aW5nU3ViamVj
        dElkPgogICAgICAgICAgICA8bGl2aW5nU3ViamVjdE5hbWU+CiAgICAgICAg
        ICAgICAgPHZhbHVlIHVzZT0iTCI+CiAgICAgICAgICAgICAgICA8Z2l2ZW4+
        S0VOTkVUSDwvZ2l2ZW4+CiAgICAgICAgICAgICAgICA8ZmFtaWx5PkFORFJF
        V1M8L2ZhbWlseT4KICAgICAgICAgICAgICA8L3ZhbHVlPgogICAgICAgICAg
        ICAgIDxzZW1hbnRpY3NUZXh0PkxlZ2FsIE5hbWU8L3NlbWFudGljc1RleHQ+
        CiAgICAgICAgICAgIDwvbGl2aW5nU3ViamVjdE5hbWU+CiAgICAgICAgICAg
        IDxvdGhlcklEc1Njb3BpbmdPcmdhbml6YXRpb24+CiAgICAgICAgICAgICAg
        PHZhbHVlIGV4dGVuc2lvbj0iVkJBIiByb290PSIyLjE2Ljg0MC4xLjExMzg4
        My40LjM0OSIvPgogICAgICAgICAgICAgIDxzZW1hbnRpY3NUZXh0Pk1WSS5P
        UkNIRVNUUkFUSU9OPC9zZW1hbnRpY3NUZXh0PgogICAgICAgICAgICA8L290
        aGVySURzU2NvcGluZ09yZ2FuaXphdGlvbj4KICAgICAgICAgIDwvcGFyYW1l
        dGVyTGlzdD4KICAgICAgICA8L3F1ZXJ5QnlQYXJhbWV0ZXI+CiAgICAgIDwv
        Y29udHJvbEFjdFByb2Nlc3M+CiAgICA8L2lkbTpQUlBBX0lOMjAxMzA1VVYw
        Mj4KICA8L2VudjpCb2R5Pgo8L2VudjpFbnZlbG9wZT4K
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Soapaction:
      - PRPA_IN201305UV02
      Date:
      - Thu, 29 Aug 2019 14:29:32 GMT
      Content-Length:
      - '3273'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      X-Backside-Transport:
      - OK OK,OK OK
      Connection:
      - Keep-Alive
      Transfer-Encoding:
      - chunked
      Date:
      - Thu, 29 Aug 2019 14:29:32 GMT
      Content-Type:
      - text/xml
      Set-Cookie:
      - JSESSIONID=kBDdyBFMWakjjWPZavixGIN9-2uLwGqBerGgiiTgphmphdQYAZ7b!-871327771;
        path=/; HttpOnly
      X-Global-Transaction-Id:
      - f8ba53155d67e14c02239302
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?>
        <env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><env:Header/><env:Body><idm:PRPA_IN201306UV02 ITSVersion="XML_1.0" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd" xmlns:idm="http://vaww.oed.oit.va.gov" xmlns="urn:hl7-org:v3"><id extension="WSDOC1908291029321091314870791" root="2.16.840.1.113883.4.349"/><creationTime value="20190829102932"/><versionCode code="4.1"/><interactionId extension="PRPA_IN201306UV02" root="2.16.840.1.113883.1.6"/><processingCode code="T"/><processingModeCode code="T"/><acceptAckCode code="NE"/><receiver typeCode="RCV"><device determinerCode="INSTANCE" classCode="DEV"><id extension="200VGOV" root="2.16.840.1.113883.4.349"/></device></receiver><sender typeCode="SND"><device determinerCode="INSTANCE" classCode="DEV"><id extension="200M" root="2.16.840.1.113883.4.349"/></device></sender><acknowledgement><typeCode code="AE"/><targetMessage><id extension="200VGOV-03b2801a-3005-4dcc-9a3c-7e3e4c0d5293" root="1.2.840.114350.1.13.0.1.7.1.1"/></targetMessage><acknowledgementDetail><code codeSystem="2.16.840.1.113883.5.1100" code="INTERR" displayName="Internal System Error"/><text>Multiple Matches Found</text></acknowledgementDetail><acknowledgementDetail><text>Multiple Matches Found</text></acknowledgementDetail></acknowledgement><controlActProcess classCode="CACT" moodCode="EVN"><code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201306UV02"/><queryAck><queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/><queryResponseCode code="AE"/><resultCurrentQuantity value="0"/></queryAck><queryByParameter><queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/><statusCode code="new"/><modifyCode code="MVI.COMP2"/><initialQuantity value="1"/><parameterList><livingSubjectAdministrativeGender><value code="M"/><semanticsText>Gender</semanticsText></livingSubjectAdministrativeGender><livingSubjectBirthTime><value value="19900220"/><semanticsText>Date of Birth</semanticsText></livingSubjectBirthTime><livingSubjectId><value extension="796295980" root="2.16.840.1.113883.4.1"/><semanticsText>SSN</semanticsText></livingSubjectId><livingSubjectName><value use="L"><given>KENNETH</given><family>ANDREWS</family></value><semanticsText>Legal Name</semanticsText></livingSubjectName><otherIDsScopingOrganization><value extension="VBA" root="2.16.840.1.113883.4.349"/><semanticsText>MVI.ORCHESTRATION</semanticsText></otherIDsScopingOrganization></parameterList></queryByParameter></controlActProcess></idm:PRPA_IN201306UV02></env:Body></env:Envelope>
    http_version: 
  recorded_at: Thu, 29 Aug 2019 14:29:33 GMT
recorded_with: VCR 3.0.3
